S-LABc/Arduino-STM32F1-Core/boards.txt
## external crystal (HSE), running at 72 MHz
nucleo_f103rb.menu.device_variant.NucleoF103_HSE=Nucleo F103 @ 72 MHz w/ crystal
nucleo_f103rb.menu.device_variant.NucleoF103_HSE.build.f_cpu=72000000L
nucleo_f103rb.menu.device_variant.NucleoF103_HSE.build.extra_flags=-DNUCLEO_HSE_CRYSTAL -DMCU_STM32F103RB -mthumb -march=armv7-m -D__STM32F1__

#-- Optimizations
nucleo_f103rb.menu.opt.osstd=Smallest (default)

nucleo_f103rb.menu.opt.o1std=Fast (-O1)
nucleo_f103rb.menu.opt.o1std.build.flags.optimize=-O1
nucleo_f103rb.menu.opt.o1std.build.flags.ldspecs=

nucleo_f103rb.menu.opt.o2std=Faster (-O2)
nucleo_f103rb.menu.opt.o2std.build.flags.optimize=-O2
nucleo_f103rb.menu.opt.o2std.build.flags.ldspecs=

nucleo_f103rb.menu.opt.o3std=Fastest (-O3)
nucleo_f103rb.menu.opt.o3std.build.flags.optimize=-O3
nucleo_f103rb.menu.opt.o3std.build.flags.ldspecs=

nucleo_f103rb.menu.opt.ogstd=Debug (-g)
nucleo_f103rb.menu.opt.ogstd.build.flags.optimize=-Og
nucleo_f103rb.menu.opt.ogstd.build.flags.ldspecs=


###################### HYTiny STM32F103TB ######################

hytiny-stm32f103t.name=HYTiny STM32F103TB

hytiny-stm32f103t.vid.0=0x1EAF
hytiny-stm32f103t.pid.0=0x0004

hytiny-stm32f103t.build.variant=hytiny_stm32f103t
hytiny-stm32f103t.build.vect=VECT_TAB_ADDR=0x8000000
hytiny-stm32f103t.build.core=maple
hytiny-stm32f103t.build.board=HYTINY_STM32F103T

hytiny-stm32f103t.upload.use_1200bps_touch=false
hytiny-stm32f103t.upload.file_type=bin
hytiny-stm32f103t.upload.auto_reset=true
hytiny-stm32f103t.build.cpu_flags=-DMCU_STM32F103CB
hytiny-stm32f103t.build.ldscript=ld/jtag.ld
hytiny-stm32f103t.upload.maximum_size=131072
hytiny-stm32f103t.upload.maximum_data_size=20480

#-- Upload Metods
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod=STM32duino bootloader
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.build.upload_flags=-DSERIAL_USB 
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.build.vect=VECT_TAB_ADDR=0x8002000
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.build.ldscript=ld/bootloader_20.ld
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.upload.usbID=1EAF:0003
hytiny-stm32f103t.menu.upload_method.DFUUploadMethod.upload.altID=2

hytiny-stm32f103t.menu.upload_method.serialMethod=Serial
hytiny-stm32f103t.menu.upload_method.serialMethod.upload.protocol=maple_serial
hytiny-stm32f103t.menu.upload_method.serialMethod.upload.tool=serial_upload
hytiny-stm32f103t.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 

hytiny-stm32f103t.menu.upload_method.STLinkMethod=STLink
hytiny-stm32f103t.menu.upload_method.STLinkMethod.upload.protocol=STLink
hytiny-stm32f103t.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
hytiny-stm32f103t.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER

hytiny-stm32f103t.menu.upload_method.jlinkMethod=JLink
hytiny-stm32f103t.menu.upload_method.jlinkMethod.upload.protocol=jlink
hytiny-stm32f103t.menu.upload_method.jlinkMethod.upload.tool=jlink_upload
hytiny-stm32f103t.menu.upload_method.jlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER 

#-- CPU Clock frequency
hytiny-stm32f103t.menu.cpu_speed.speed_72mhz=72Mhz (Normal)
hytiny-stm32f103t.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

hytiny-stm32f103t.menu.cpu_speed.speed_48mhz=48Mhz (Slow - with USB)
hytiny-stm32f103t.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

hytiny-stm32f103t.menu.cpu_speed.speed_128mhz=Overclocked 128Mhz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
hytiny-stm32f103t.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
hytiny-stm32f103t.menu.opt.osstd=Smallest (default)

hytiny-stm32f103t.menu.opt.o1std=Fast (-O1)
hytiny-stm32f103t.menu.opt.o1std.build.flags.optimize=-O1
hytiny-stm32f103t.menu.opt.o1std.build.flags.ldspecs=

hytiny-stm32f103t.menu.opt.o2std=Faster (-O2)
hytiny-stm32f103t.menu.opt.o2std.build.flags.optimize=-O2
hytiny-stm32f103t.menu.opt.o2std.build.flags.ldspecs=

hytiny-stm32f103t.menu.opt.o3std=Fastest (-O3)
hytiny-stm32f103t.menu.opt.o3std.build.flags.optimize=-O3
hytiny-stm32f103t.menu.opt.o3std.build.flags.ldspecs=

hytiny-stm32f103t.menu.opt.ogstd=Debug (-g)
hytiny-stm32f103t.menu.opt.ogstd.build.flags.optimize=-Og
hytiny-stm32f103t.menu.opt.ogstd.build.flags.ldspecs=


###################### STM32VLD to FLASH ######################

STM32VLD.name=STM32VLD to FLASH

STM32VLD.build.vect=VECT_TAB_ADDR=0x8000000
STM32VLD.build.core=maple
STM32VLD.build.board=STM32VLD
STM32VLD.build.variant=STM32VLD
STM32VLD.build.ldscript=ld/jtag.ld
STM32VLD.build.family=cortex-m3
STM32VLD.build.f_cpu=24000000L
STM32VLD.build.cpu_flags=-DMCU_STM32F100RB

STM32VLD.upload.use_1200bps_touch=false
STM32VLD.upload.file_type=bin
STM32VLD.upload.auto_reset=true
STM32VLD.upload.params.quiet=no

#-- Upload Metods
STM32VLD.menu.upload_method.STLinkMethod=STLink
STM32VLD.menu.upload_method.STLinkMethod.upload.protocol=STLink
STM32VLD.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
STM32VLD.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG  

#-- CPU Clock frequency
STM32VLD.menu.cpu_speed.speed_72mhz=72Mhz (Normal)
STM32VLD.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

STM32VLD.menu.cpu_speed.speed_48mhz=48Mhz (Slow - with USB)
STM32VLD.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

STM32VLD.menu.cpu_speed.speed_128mhz=Overclocked 128Mhz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
STM32VLD.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
STM32VLD.menu.opt.osstd=Smallest (default)

STM32VLD.menu.opt.o1std=Fast (-O1)
STM32VLD.menu.opt.o1std.build.flags.optimize=-O1
STM32VLD.menu.opt.o1std.build.flags.ldspecs=

STM32VLD.menu.opt.o2std=Faster (-O2)
STM32VLD.menu.opt.o2std.build.flags.optimize=-O2
STM32VLD.menu.opt.o2std.build.flags.ldspecs=

STM32VLD.menu.opt.o3std=Fastest (-O3)
STM32VLD.menu.opt.o3std.build.flags.optimize=-O3
STM32VLD.menu.opt.o3std.build.flags.ldspecs=

STM32VLD.menu.opt.ogstd=Debug (-g)
STM32VLD.menu.opt.ogstd.build.flags.optimize=-Og
STM32VLD.menu.opt.ogstd.build.flags.ldspecs=


